package lib;

public class AllureTagsList {

    /*
    В моих тестах на данный момент используются только два тэга @Step и @Description. Так как на данный момент в остальных
    тегах пока нет необходимости. Но в ближайшем будущем буду использовать @Epic, @Feature и @Owner
     */

    /*
    @Attachment- Добавление информации  в отчет в виде файла с соответствующим расширением. Наименование вложения будет таким же, как и имя вызываемого метода.
@Step- Обозначения тестового шага
@Description — Прикрепляет описание к тесту или шагу теста.
@Epic —  Группирует тесты по эпикам.
@Epics — тоже самое, что и @Epic, но в качестве параметра «value» принимает массив Epic'ов.
@Feature — Группирует тесты по проверяемому функционалу
@Features — тоже самое, что и @Feature, но в качестве параметра «value» принимает массив Feature'ей.
@Story — Группирует тесты по User story.
@Stories — тоже самое, что и @Story, но в качестве параметра «value» принимает массив Story'й.
@Flaky — Помечает автотест как нестабильный.
@Issue — Линкует автотесты с заведенными Issue.
@Issues — тоже самое, что и @Issue, но в качестве параметра «value» принимает массив Issue.
@TmsLink — Линкует автотесты с тест-кейсами, шаги которых описаны в системах управления тестированием
@TmsLinks — тоже самое, что и @TmsLink, но в качестве параметра «value» принимает массив TmsLink'ов.
@Link — Прикладывает к автотесту ссылки на какие-то внешние ресурсы.
@Links — тоже самое, что и @Link, но в качестве параметра «value» принимает массив Link'ов.
@Owner — Указывает ответственное лицо за тест.
@Severity — Указывает уровень критичности функционала, проверяемого автотестом.
     */
}
